BINARY_NAME=main
MAIN_PATH=./cmd/main.go
BUILD_DIR=bin

.PHONY: help build run test

define LOGO_TEXT
  /$$$$$$$$$$$$  /$$$$                            /$$$$$$$$$$$$  /$$$$
 /$$$$__  $$$$| $$$$                           /$$$$__  $$$$| $$$$
| $$$$  \\__/| $$$$  /$$$$$$$$$$$$   /$$$$$$$$$$$$$$      | $$$$  \\__/| $$$$  /$$$$$$$$$$$$   /$$$$$$$$$$$$$$
| $$$$      | $$$$ |____  $$$$ /$$$$_____/      | $$$$      | $$$$ |____  $$$$ /$$$$_____/
| $$$$      | $$$$  /$$$$$$$$$$$$$$| $$$$            | $$$$      | $$$$  /$$$$$$$$$$$$$$| $$$$
| $$$$    $$$$| $$$$ /$$$$__  $$$$| $$$$            | $$$$    $$$$| $$$$ /$$$$__  $$$$| $$$$
|  $$$$$$$$$$$$/| $$$$|  $$$$$$$$$$$$$$|  $$$$$$$$$$$$$$      |  $$$$$$$$$$$$/| $$$$|  $$$$$$$$$$$$$$|  $$$$$$$$$$$$$$
 \\______/ |__/ \\_______/ \\_______/       \\______/ |__/ \\_______/ \\_______/

 --- The best team ever
endef
export LOGO_TEXT

help:
	@echo ""
	@echo "$$LOGO_TEXT"
	@echo ""
	@echo "Доступные команды:"
	@echo ""
	@echo "  build   - Собрать исполняемый файл"
	@echo "  run     - Запустить приложение"
	@echo "  test    - Запустить все тесты"
	@echo ""

build:
	go build -o $(BUILD_DIR)/$(BINARY_NAME) $(MAIN_PATH)

run: build
	@./$(BUILD_DIR)/$(BINARY_NAME)

test:
	go test -v -race -cover ./...
